import img1 from "./public/img/tribute.png";
import img2 from "./public/img/surveyform.jpg";
import img3 from "./public/img/tech.jpg";
import img4 from "./public/img/landingPage.png";
import img5 from "./public/img/event.png";
import img6 from "./public/img/parallax.jpg";
import img7 from "./public/img/portfolio.jpg";
import img8 from "./public/img/res.png";
import img9 from "./public/img/music.png";
import img10 from "./public/img/photo.jpg";

import java1 from "./public/img/java1.png";
import java2 from "./public/img/java2.png";
import java3 from "./public/img/java3.png";
import java4 from "./public/img/java4.png";
import java5 from "./public/img/java5.png";
import java6 from "./public/img/java6.png";
import java7 from "./public/img/java7.png";
import java8 from "./public/img/java8.png";
import java9 from "./public/img/java9.png";
import java10 from "./public/img/java10.png";

import pp1 from "./public/img/pp1.png";
import pp2 from "./public/img/pp2.png";
import pp3 from "./public/img/pp3.png";
import pp4 from "./public/img/pp4.png";
import pp5 from "./public/img/pp5.png";
import pp6 from "./public/img/pp6.png";
import pp7 from "./public/img/pp7.png";
import pp8 from "./public/img/pp8.png";
import pp9 from "./public/img/pp9.png";
import pp10 from "./public/img/pp10.png";
import pp11 from "./public/img/pp11.png";

import hw1 from "./public/img/hw1.png";
import hw2 from "./public/img/hw2.png";
import hw3 from "./public/img/hw3.png";
import hw4 from "./public/img/hw4.png";
import hw5 from "./public/img/hw5.png";
import hw6 from "./public/img/hw6.png";

export const articles = [
  {
    id: 1,
    category: "html",
    title: "1. A tribute page (ဂုဏ်ပြုသောစာမျက်နှာ)",
    body: " ဤသည်မှာ သင်လုပ်နိုင်သော အရိုးရှင်းဆုံး HTML ပရောဂျက်များထဲမှ တစ်ခုဖြစ်သည်။ အမည်ဖြင့် ခန့်မှန်းနိုင်သကဲ့သို့၊ ချီးကျူးဂုဏ်ပြုသည့် စာမျက်နှာတစ်ခုသည် သင့်အား စိတ်အားထက်သန်သူ သို့မဟုတ် သင်လေးစားကြည်ညိုသူတစ်ဦးကို လေးစားကြောင်း ပြသသည်။ ဂုဏ်ပြုစာမျက်နှာတစ်ခုပြုလုပ်ရန် အခြေခံ HTML သဘောတရားများကိုသာ သိရန်လိုအပ်ပါသည်။အရင်ဆုံး ဝဘ်စာမျက်နှာတစ်ခုကို ဖန်တီးရပါမယ်။ ထို့နောက် သင်ဂုဏ်ပြုပေးသော ပုဂ္ဂိုလ်၏ပုံတစ်ပုံကို ထည့်နိုင်ပြီး ထိုသူ၏အသေးစိတ်အချက်အလက်များ၊ အောင်မြင်မှုများနှင့် အခြားအရာများကို ထည့်နိုင်သည်။ သင်ဆန္ဒရှိလျှင် သင်သည် သူ/သူမအတွက် လေးစားသော စကားလုံးအချို့ကိုလည်း ရေးသားနိုင်သည်။ ဤပရောဂျက်အတွက် CSS ကိုအသုံးပြုခြင်းသည် သင့်အား မတူညီသောပုံစံများနှင့် အပြင်အဆင်များပါ၀င်စေသောကြောင့် အကျိုးရှိမည်ဖြစ်သည်။ ဝဘ်စာမျက်နှာကို ဆွဲဆောင်မှုရှိသော နောက်ခံအရောင်ဖြစ်စေရန် သေချာပါစေ။ (မြေကြီးအရောင် သို့မဟုတ် pastel အရောင်များကိုသုံးပါ)။",
    img: img1,
  },
  {
    id: 2,
    category: "html",
    title: "2. A survey form (စစ်တမ်းပုံစံ)",
    body: "ဝဘ်ဆိုဒ်များသည် ၎င်းတို့၏ ဖောက်သည်ဒေတာစုဆောင်းမှုဗျူဟာ၏ တစ်စိတ်တစ်ပိုင်းအဖြစ် ဖောင်များကို မကြာခဏ ထည့်သွင်းလေ့ရှိသည်။ ကောင်းစွာပြုလုပ်ထားသော စစ်တမ်းပုံစံတစ်ခုသည် သင့်အား ၎င်းတို့၏လူဦးရေစာရင်း၊ အလုပ်၊ တည်နေရာ၊ အရသာနှင့် နှစ်သက်မှုများနှင့် နာကျင်မှုအချက်များကဲ့သို့သော သင့်ပစ်မှတ်ပရိသတ်များအကြောင်း သက်ဆိုင်ရာအချက်အလက်များကို ရရှိရန် ကူညီပေးနိုင်ပါသည်။ ဤ HTML ပရောဂျက်သည် ပုံစံများ ဒီဇိုင်းရေးဆွဲခြင်းနှင့် ဝဘ်စာမျက်နှာတစ်ခု တည်ဆောက်ခြင်းဆိုင်ရာ သင်၏ကျွမ်းကျင်မှုနှင့် အသိပညာကို စမ်းသပ်ရန် ကောင်းမွန်သော နည်းလမ်းတစ်ခုဖြစ်သည်။စစ်တမ်းပုံစံတည်ဆောက်ခြင်းသည် ဒုံးပျံသိပ္ပံမဟုတ်ပါ။ ဖောင်များကို ဒီဇိုင်းထုတ်ရန် လိုအပ်သော HTML ရှိ အခြေခံ တဂ်များ/ထည့်သွင်းမှု အကွက်များကို သင်ကိုယ်တိုင် သိထားရန် လိုအပ်သည်။ ထို့နောက် ဖောင်တစ်ခုတွင်ပါရှိသော စာသားအကွက်၊ အမှတ်ခြစ်ကွက်၊ ရေဒီယိုခလုတ်၊ ရက်စွဲနှင့် အခြားအရေးကြီးသောဒြပ်စင်များကို ဖန်တီးရန် တဂ်များကို သင်အသုံးပြုနိုင်သည်။ တစ်ဖန်၊ သင်သည် သင်၏ပုံစံနှင့် ဝဘ်စာမျက်နှာကို ပိုမိုကောင်းမွန်သောအသွင်အပြင်နှင့် ခံစားရစေရန် CSS ကို အမြဲသုံးနိုင်သည်။",
    img: img2,
  },
  {
    id: 3,
    category: "html",
    title:
      "3. Technical documentation page (နည်းပညာဆိုင်ရာစာရွက်စာတမ်းစာမျက်နှာ)",
    body: "HTML၊ CSS နှင့် JavaScript တို့ကို အခြေခံသိထားလျှင် နည်းပညာဆိုင်ရာ စာရွက်စာတမ်း စာမျက်နှာတစ်ခုကို တည်ဆောက်နိုင်ပါသည်။ ဤပရောဂျက်၏နောက်ကွယ်တွင် အဓိကစိတ်ကူးမှာ စာမျက်နှာ၏ဘယ်ဘက်ရှိ မည်သည့်အကြောင်းအရာကိုမဆို သင်နှိပ်နိုင်သည့် နည်းပညာဆိုင်ရာစာရွက်စာတမ်းစာမျက်နှာတစ်ခုကို ဖန်တီးရန်နှင့် ၎င်းသည် ညာဘက်တွင် ဆက်စပ်အကြောင်းအရာများကို တင်မည်ဖြစ်သည်။ပရောဂျက်သည် ရိုးရှင်းပြီး ရိုးရှင်းသော နည်းပညာဆိုင်ရာ စာရွက်စာတမ်း စာမျက်နှာတစ်ခုဖြစ်ပြီး စိတ်ကူးယဉ်စရာမရှိပါ။ ဤ HTML ပရောဂျက်ကို တည်ဆောက်ရန်အတွက် ဝဘ်စာမျက်နှာကို အပိုင်းနှစ်ပိုင်းခွဲရပါမည်။ ဘယ်ဘက်ခြမ်းတွင် ခေါင်းစဉ်အားလုံးကို အပေါ်မှအောက်ခြေပုံစံဖြင့် စီစဉ်ပေးသည့် မီနူးပါရှိသော်လည်း ညာဘက်တွင် ခေါင်းစဉ်တစ်ခုစီနှင့် သက်ဆိုင်သည့် စာရွက်စာတမ်း (ဖော်ပြချက်) ပါရှိမည်ဖြစ်သည်။ ကလစ်လုပ်ဆောင်ချက်ကို ထည့်သွင်းရန်၊ သင်သည် CSS စာညှပ် သို့မဟုတ် Javascript ကို အသုံးပြုနိုင်သည်။",
    img: img3,
  },
  {
    id: 4,
    category: "html",
    title: "4. Landing page",
    body: "ဤပရောဂျက်သည် HTML နှင့် CSS ကို ခိုင်မာသော အသိပညာ လိုအပ်သည်။ ဆင်းသက်သည့်စာမျက်နှာတစ်ခုတွင် အရေးကြီးသောဒြပ်စင်များစွာပါဝင်သောကြောင့်၊ သင်၏ HTML အသိပညာကို သင်၏ဖန်တီးမှုစွမ်းရည်များနှင့် ပေါင်းစပ်ရမည်ဖြစ်ပါသည်။ဆင်းသက်သည့် စာမျက်နှာအတွက်၊ သင်သည် ကော်လံများနှင့် အနားသတ်များကို ဖန်တီးရန်၊ ကော်လံများ၊ အကွက်များအတွင်း အရာများကို ချိန်ညှိရန်၊ အောက်ခြေမှတ်စုနှင့် ခေါင်းစီးကို ပေါင်းထည့်ရန်၊ အကြောင်းအရာ/ဆိုက်ဒြပ်စင်များအတွက် သီးခြားကဏ္ဍများကို ဖန်တီးရန်နှင့် ပုံများကို တည်းဖြတ်ရန် (ဖြတ်တောက်ပြီး အရွယ်အစားပြောင်းရန်)။ ထို့အပြင်၊ သင်သည် စာမျက်နှာအတွက် မှန်ကန်သောအရောင်များကို ရွေးချယ်ရမည်ဖြစ်သည်။ အရောင်ပေါင်းစပ်မှုများသည် တစ်ခုနှင့်တစ်ခု အားဖြည့်ပေးရန်အတွက် ဖြစ်သင့်သည် - အပိုင်းတစ်ခုစီတွင် မတူညီသောအရောင်ရှိနိုင်သည်။ ပုံစံဒီဇိုင်းနှင့် အပြင်အဆင်အတွက် CSS ကို သင်အသုံးပြုသောအခါ၊ စာမျက်နှာအစိတ်အပိုင်းများသည် မည်သည့်နေရာတွင်မျှ မထိမခိုက်မိကြောင်း သေချာပါစေ။",
    img: img4,
  },
  {
    id: 5,
    category: "html",
    title: "5. Event page (ပွဲစာမျက်နာ)",
    body: "ဒါက သင်စမ်းသပ်နိုင်တဲ့ နောက်ထပ် လွယ်ကူတဲ့ ပရောဂျက်တစ်ခုပါ။ ၎င်းတွင် ပွဲတစ်ခု၏အသေးစိတ်အချက်များ (ကွန်ဖရင့်၊ webinar၊ ထုတ်ကုန်မိတ်ဆက်ပွဲ စသည်) ကိုပြသသည့် အငြိမ်စာမျက်နှာကို ဖန်တီးခြင်းတွင် ပါဝင်မည်ဖြစ်သည်။ ဤပရောဂျက်အတွက် သင်သည် HTML နှင့် CSS နှစ်ခုစလုံး လိုအပ်မည်ဖြစ်သည်။ပွဲစာမျက်နှာ၏ အပြင်အဆင်သည် ရိုးရှင်းပါသည်။ ခေါင်းစီးကဏ္ဍတွင် လင့်ခ်များ၊ ပွဲကျင်းပမည့်နေရာနှင့် အချိန်ဇယားပါ မတူညီသော စပီကာများ၏ အမည်များနှင့် ရုပ်ပုံများပါရှိသည်။ ပွဲ၏ ရည်ရွယ်ချက်ကို ဖော်ပြသည့် ကဏ္ဍတစ်ခုလည်း ပါဝင်ရမည် - ပွဲအတွက် မည်သည်နှင့် မည်သည့် ပရိသတ်အမျိုးအစားကို ပစ်မှတ်ထားရန် ရည်ရွယ်သည်။ စာမျက်နှာကို သပ်ရပ်လှပစေရန်အတွက် အတုံးသေးသေးလေးများခွဲပါ။ စာမျက်နှာရှိ ကဏ္ဍတစ်ခုစီအတွက် မှန်ကန်သော ဖောင့်ပုံစံ၊ ဖောင့်အရောင်နှင့် နောက်ခံအရောင်ကို ရွေးချယ်ပါ။ ထို့အပြင် စိတ်ပါဝင်စားသူများသည် ပွဲအတွက် စာရင်းပေးသွင်းနိုင်စေရန် မှတ်ပုံတင်ရန် ခလုတ်ကို ထည့်သွင်းရန် သေချာစေပါ။",
    img: img5,
  },
  {
    id: 6,
    category: "html",
    title: "6. Parallax website ",
    body: "HTML သဘောတရားများကို ကောင်းစွာနားလည်သော စတင်သူသည် တစ်ရက်အတွင်း parallax ဝဘ်ဆိုဒ်ကို တည်ဆောက်နိုင်သည်။ အခြေခံအားဖြင့်၊ parallax ဝဘ်ဆိုဒ်သည် နောက်ခံတွင် ပုံသေပုံပါရှိကာ ၎င်းပုံ၏ မတူညီသော အစိတ်အပိုင်းများကို ကြည့်ရှုရန် စာမျက်နှာကို အပေါ်နှင့် အောက်သို့ ရွှေ့ရန် ခွင့်ပြုသည်။ ၎င်းသည် ဝဘ်ဆိုက်တစ်ခုပေါ်တွင် လှပပြီး ထူးခြားသောအကျိုးသက်ရောက်မှုကိုပေးသည်။parallax site တစ်ခုတည်ဆောက်ရန်၊ ပထမဦးစွာ စာမျက်နှာကို သုံးပိုင်းမှ လေးပိုင်းခွဲပါ။ နောက်ခံပုံအချို့ကို ရွေးချယ်ပါ၊ သင့်လျော်သောစာသားနှင့်အတူ မတူညီသောကဏ္ဍများရှိ စာမျက်နှာပေါ်တွင် ၎င်းတို့ကို ညှိပါ၊ အနားသတ်နှင့် ကွက်ဒ်ကို သတ်မှတ်ပြီး နောက်ခံအနေအထားကို ပေါင်းစပ်ပါ။ စာမျက်နှာရှိ အခြားစတိုင်လ်ဒြပ်စင်များ ထည့်သွင်းရန် CSS ကို အသုံးပြုနိုင်သည်။",
    img: img6,
  },
  {
    id: 7,
    category: "html",
    title: "7. Personal portfolio page (ကိုယ်ရေးကိုယ်တာ အစုစု စာမျက်နှာ)",
    body: "ကိုယ်ပိုင်အစုစုစာမျက်နှာတစ်ခုဖန်တီးရန်၊ သင်သည် HTML5 နှင့် CSS3 တို့ကို ကျွမ်းကျင်ရန်လိုသည်။ ဤပရောဂျက်တွင် သင့်အမည်နှင့် ရုပ်ပုံ၊ ပရောဂျက်များ၊ အထူးကျွမ်းကျင်မှုနှင့် စိတ်ဝင်စားမှုများအပါအဝင် အလုပ်အစုစုအတွက် စံအချက်အလက်များပါရှိသော ဝဘ်စာမျက်နှာကို သင်ဖန်တီးမည်ဖြစ်သည်။ သင်ဆန္ဒရှိပါက သင်၏ CV ကိုထည့်၍ သင်၏ GitHub အကောင့်မှတစ်ဆင့် GitHub တွင် အစုစုအပြည့်အစုံကို လက်ခံဆောင်ရွက်ပေးနိုင်ပါသည်။အစုစုစာမျက်နှာတွင် ခေါင်းစီးနှင့် အောက်ခြေအပိုင်းရှိသင့်သည်။ ခေါင်းစီးကဏ္ဍတွင် သင်၏ကိုယ်ရေးကိုယ်တာအချက်အလက်များ၊ ဆက်သွယ်ရန်အချက်အလက်နှင့် အလုပ်တို့ကို မီးမောင်းထိုးပြသည့် မီနူးတစ်ခု ပါဝင်မည်ဖြစ်သည်။ သင့်ဓာတ်ပုံကို စာမျက်နှာ၏ထိပ်ပိုင်းတွင် ထားနိုင်ပြီး သင်၏ပရော်ဖက်ရှင်နယ်အသက်မွေးဝမ်းကြောင်းနှင့် စိတ်ဝင်စားမှုများအကြောင်း အတိုချုံးဖော်ပြချက်ပါရှိသည်။ ဤဖော်ပြချက်အောက်တွင် သင်သည် အလုပ်နမူနာအနည်းငယ်ကို ထည့်သွင်းနိုင်သည်။ အောက်ခြေအပိုင်းတွင် သင်၏ ဆိုရှယ်မီဒီယာ လက်ကိုင်များ ပါဝင်နိုင်သည်။",
    img: img7,
  },
  {
    id: 8,
    category: "html",
    title: "8. Restaurant website (စားသောက်ဆိုင်ဝဘ်ဆိုဒ်)",
    body: "ဤပရောဂျက်သည် သင့်အား သင်၏ ဖန်တီးမှုစွမ်းရည်များကို ပြသရန် အခွင့်အလမ်းများစွာ ပေးပါလိမ့်မည်။ သင်ခန့်မှန်းနိုင်သကဲ့သို့၊ စားသောက်ဆိုင်ဝဘ်ဆိုဒ်သည် လုပ်ဆောင်ချက်များအများအပြားအပါအဝင် အသေးစိတ်နှင့်အသေးစိတ်ရှိရန် လိုအပ်ပါသည်။ပထမဦးစွာ၊ သင်သည် မတူညီသောဒြပ်စင်များကို ထည့်သွင်းရမည်ဖြစ်ပြီး စွဲမက်ဖွယ်ကောင်းသော ဝဘ်စာမျက်နှာအပြင်အဆင်ကို ဒီဇိုင်းရေးဆွဲရန် လိုအပ်သည်။ ၎င်းတွင် အစားအသောက်ပစ္စည်းများစာရင်း၊ အစားအသောက်ပစ္စည်းများအတွက် တစ်ကြောင်းတည်းဖော်ပြချက်၊ ဈေးနှုန်းများ၊ မတူညီသောဟင်းပွဲများ၏ ဆွဲဆောင်မှုရှိသောပုံများ၊ ဆိုရှယ်မီဒီယာခလုတ်များ၊ ဆက်သွယ်ရန်အချက်အလက်များ၊ အွန်လိုင်းကြိုတင်မှာယူမှုရွေးချယ်စရာနှင့် အခြားလိုအပ်သောအသေးစိတ်အချက်အလက်များ ပါဝင်မည်ဖြစ်သည်။ CSS ကို အသုံးပြု၍ အမျိုးမျိုးသော အစားအသောက်/အဖျော်ယမကာများနှင့် ၎င်းတို့၏ သက်ဆိုင်ရာစျေးနှုန်းများကို ဇယားကွက်တစ်ခုအတွင်း ချိန်ညှိနိုင်သည်။စားသောက်ဆိုင် ဝဘ်ဆိုဒ်ကို ဖန်တီးသည့်အခါ၊ စတိုင်ကျသော အပြင်အဆင်များ၊ သပ်ရပ်သော ဖောင့်စတိုင်များနှင့် ဆွဲဆောင်မှုရှိသော အရောင်ပေါင်းစပ်မှုကို အသုံးပြုရန် အာရုံစိုက်ရပါမည်။ ဝဘ်ဆိုဒ်ကို ပိုထက်မြက်အောင် ပြုလုပ်လိုပါက၊ မတူညီသော အစားအစာပစ္စည်းများ၏ လျှောလျှောပုံများ ပါရှိသည့် ဓာတ်ပုံပြခန်းကို ထည့်သွင်းနိုင်သည်။ ပရိသတ်များ ဆိုက်တစ်လျှောက် ပိုမိုကောင်းမွန်စွာသွားလာနိုင်ရန် ကူညီရန် ဝဘ်ဆိုက်ပေါ်တွင် သက်ဆိုင်ရာလင့်ခ်များကို သင်ထည့်သွင်းနိုင်သည်။",
    img: img8,
  },
  {
    id: 9,
    category: "html",
    title: "9. Music store page (ဂီတဆိုင်စာမျက်နှာ)",
    body: "ဂီတစတိုးဆိုင်စာမျက်နှာသည် ဂီတချစ်သူများအတွက် ပြီးပြည့်စုံသော စမ်းသပ်မှုတစ်ခုဖြစ်သည်။ ဤစာမျက်နှာကိုတည်ဆောက်ရန်၊ HTML5 နှင့် CSS3 ၏ နစ်မြုပ်မှုရှိသော အဓိပ္ပါယ်ကို သိရပါမည်။တေးဂီတစာမျက်နှာတွင် ပထမဆုံးလုပ်ရမည့်အချက်မှာ သင့်လျော်သောနောက်ခံပုံတစ်ပုံကို ထည့်သွင်းပြီး ဤစာမျက်နှာပေါ်တွင် သင်တွေ့ရမည့်အရာအကြောင်း အတိုချုံးဖော်ပြချက်တစ်ခုရေးပါ။ စာမျက်နှာ၏ ခေါင်းစီးကဏ္ဍတွင် အမျိုးအစား၊ နှစ်၊ အဆိုတော်၊ အယ်လ်ဘမ်စသည်ဖြင့် အမျိုးအစားအလိုက် သီချင်းများကို စာရင်းပြုစုသည့် မတူညီသော မီနူးများ ပါရှိသည်။စတင်ရန်၊ ရပ်တန့်ရန်၊ ပြန်ရစ်ခြင်း/ရှေ့သို့ စသည်တို့ကဲ့သို့သော လိုအပ်သောခလုတ်များပါ၀င်ရပါမည်။ ရရှိနိုင်သော သီချင်းများစုစည်းမှုအတွက် သက်ဆိုင်ရာလင့်များနှင့် ပုံများကို ထည့်ပါ။ အောက်ခြေတွင် သင်သည် မှတ်ပုံတင်ခြင်းအတွက် အဆက်အသွယ်အသေးစိတ်များနှင့် လင့်ခ်များ၊ စတိုးဆိုင်တွင်းဝယ်ယူမှုများ၊ စာရင်းသွင်းမှုပက်ကေ့ဂျ်များနှင့် အစမ်းသုံးရွေးချယ်စရာများကို ထည့်သွင်းနိုင်သည်။",
    img: img9,
  },
  {
    id: 10,
    category: "html",
    title: "10. Photography website (ဓာတ်ပုံဝက်ဘ်ဆိုက်)",
    body: "ဤသည်မှာ ကျွန်ုပ်တို့၏စာရင်းတွင် နောက်ဆုံးပရောဂျက်ဖြစ်သည်။ တစ်ဖန်၊ သင်သည် ဤဓာတ်ပုံပညာဝဘ်ဆိုဒ်ကို ဖွံ့ဖြိုးတိုးတက်ရန် HTML5 နှင့် CSS3 နှင့် လုပ်ဆောင်ရန် လိုအပ်မည်ဖြစ်သည်။ စိတ်ကူးသည် စာမျက်နှာတစ်မျက်နှာပါ တုံ့ပြန်မှုရှိသော ဓာတ်ပုံဆိုက်တစ်ခု ဖန်တီးရန်ဖြစ်သည်။ဆင်းသက်သည့်စာမျက်နှာ၏ထိပ်တွင်၊ ဆိုက်အတွက် ရိုးရှင်းသောဖော်ပြချက်နှင့်အတူ အမှတ်တံဆိပ်အမည်နှင့် လိုဂိုကို ထည့်ပါ။ အသုံးပြုသူများသည် ပုံများကဏ္ဍသို့သွားကာ အောက်ပါပုံများကိုကြည့်ရှုရန် slide များကို ကြည့်ရှုရန် ခလုတ်တစ်ခုပါရှိသော ပြခန်းတစ်ခုကို ဖန်တီးနိုင်သည်။ ဇယားကွက်၊ စာရင်း အစရှိသည်တို့ကဲ့သို့ မတူညီသော ကြည့်ရှုမှုအပြင်အဆင်များကို သိမ်းဆည်းထားနိုင်သည်။ စာမျက်နှာအတွက် အနားသတ်နှင့် အကွက်များကို ပေါင်းထည့်ကာ သင်နှစ်သက်သော အရောင်ပေါင်းစပ်မှု၊ ဖောင့်စတိုင်နှင့် ပုံအရွယ်အစားကို ရွေးချယ်ပါ။ တုံ့ပြန်မှုပမာဏအတွက်၊ သင်သည် flexbox နှင့် media queries ကိုသုံးနိုင်သည်။",
    img: img10,
  },
  {
    id: 11,
    category: "java",
    title: "1. Smart City Project",
    body: "ဤ Smart City ပရောဂျက်သည် ဟိုတယ်များ၊ သယ်ယူပို့ဆောင်ရေး အဆောက်အအုံများ၊ လေယာဉ်လက်မှတ်ကြိုတင်မှာယူမှု၊ စျေးဝယ်အသေးစိတ်၊ မြို့သတင်းများအကြောင်း မြို့သို့လာရောက်လည်ပတ်သူများအား ပြောပြပေးသည်။ ၎င်းသည် ဧည့်သည်အသစ်များကြုံတွေ့ရသည့် ပြဿနာအများစုကို ဖြေရှင်းပေးသည့် Java Programming ဘာသာစကားဖြင့် တီထွင်ထားသည့် ဝဘ်အခြေခံဆော့ဖ်ဝဲတစ်ခုဖြစ်သည်။ လမ်းကြောင်းရှာဖွေခြင်း၊ ဟိုတယ်ရှာဖွေခြင်း နှင့် လက်မှတ်ကြိုတင်မှာယူခြင်းကဲ့သို့သော မြို့သစ်သို့ရောက်သောအခါ၊",
    img: java1,
  },
  {
    id: 12,
    category: "java",
    title: "2. Currency Converter",
    body: "ဤငွေကြေးပြောင်းစက်သည် ငွေကြေးတစ်ခုမှ အခြားငွေကြေးတစ်ခုသို့ ငွေလဲလှယ်ခြင်း/ငွေပြောင်းခြင်းအတွက် ဝဘ်အခြေခံအင်တာဖေ့စ်ကို ပံ့ပိုးပေးသည့် အသေးစား Java ပရောဂျက်တစ်ခုဖြစ်သည်။ ၎င်းကို Ajax၊ Java servlets ဝဘ်အင်္ဂါရပ်များကို အသုံးပြု၍ ဖန်တီးထားသည်။ ထိုကဲ့သို့သော အသုံးချပရိုဂရမ်များကို စီးပွားရေးလုပ်ငန်းတွင် အသုံးပြုခဲ့သည်။",
    img: java2,
  },
  {
    id: 13,
    category: "java",
    title: "3. Number Guessing Game",
    body: "ဤကိန်းဂဏန်းဂိမ်းကို ခန့်မှန်းခြင်းသည် အသုံးပြုသူအား ကွန်ပျူတာမှထုတ်ပေးသော နံပါတ်ကို ခန့်မှန်းနိုင်စေမည့် Java ပရောဂျက်တိုတစ်ခုဖြစ်သည်။ နောက်ထပ် အဝိုင်းများထည့်ခြင်း သို့မဟုတ် ရမှတ်ပြသခြင်းကဲ့သို့ ဂိမ်းကို ပြောင်းလဲရန် နည်းလမ်းများစွာလည်း ရှိပါသည်။ ၎င်းသည် အလွန်ရိုးရှင်းပြီး နံပါတ်တစ်ခုထုတ်လုပ်ရန် ကျပန်းလုပ်ဆောင်ချက်ကို အသုံးပြုသည်။",
    img: java3,
  },
  {
    id: 14,
    category: "java",
    title: "4. Brick Breaker Game",
    body: "ဤ brick breaker ဂိမ်းသည် ဖန်သားပြင်ထိပ်ရှိ အုတ်များကို ချိုးဖျက်ရန် သင်ကြိုးစားပေးသည့် ပျော်စရာ Java ပရောဂျက်များစွာထဲမှ တစ်ခုဖြစ်သည်။ ကစားသူသည် မြှားခလုတ်များကို အသုံးပြု၍ ဘယ်မှညာသို့ ရွှေ့နိုင်သည့် စခရင်အောက်ခြေရှိ ပလပ်ဖောင်းငယ်တစ်ခုပေါ်တွင် သေးငယ်သောဘောလုံးကို ထိန်းချုပ်သည်။ ပန်းတိုင်သည် သင်၏ပလက်ဖောင်းဖြင့် ဘောလုံးကို မလွတ်စေဘဲ အုတ်ခဲများကို ချိုးဖျက်ရန်ဖြစ်သည်။ ပရောဂျက်သည် အခြားအရာများထဲမှ Java swing နှင့် OOPS သဘောတရားများကို အသုံးပြုသည်။",
    img: java4,
  },
  {
    id: 15,
    category: "java",
    title: "5. Data Visualization Software",
    body: "Data Visualization ဆော့ဖ်ဝဲလ်ကို ဖန်တီးပြီးသည့်တိုင်အောင် ကိန်းဂဏန်းဂရပ်ဖစ်နှင့် သိပ္ပံနည်းကျ အမြင်အာရုံကို အသုံးပြု၍ ဒေတာကို အမြင်အာရုံဖြင့် ပြသပေးသောကြောင့် ဒေတာမြင်ယောင်ခြင်းမှာ အရေးကြီးပါသည်။ ဤပရောဂျက်သည် ဒေတာမြင်ယောင်မှုပုံစံတွင် ကွန်ရက်ချိတ်ဆက်မှုတွင် node ချိတ်ဆက်မှုကို ပြသသည်။ ဤ node ချိတ်ဆက်မှုအား mouse သို့မဟုတ် trackpad မှတဆင့် မတူညီသောနေရာများတွင် တည်ရှိနိုင်သည်။",
    img: java5,
  },
  {
    id: 16,
    category: "java",
    title: "6. ATM Interface",
    body: "ဤအတန်ငယ်ရှုပ်ထွေးသော Java ပရောဂျက်သည် မတူညီသောအတန်းငါးခုပါ၀င်ပြီး console-based application တစ်ခုဖြစ်သည်။ စနစ်စတင်သောအခါ သုံးစွဲသူအား သုံးစွဲသူ ID နှင့် အသုံးပြုသူပင်နံပါတ်ဖြင့် အချက်ပြသည်။ အသေးစိတ်အချက်အလက်များကို အောင်မြင်စွာထည့်သွင်းပြီးနောက်၊ ATM လုပ်ဆောင်ချက်များကို လော့ခ်ဖွင့်ပေးပါသည်။",
    img: java6,
  },
  {
    id: 17,
    category: "java",
    title: "7. Web Server Management System",
    body: "ဤဝဘ်ဆာဗာ စီမံခန့်ခွဲမှုစနစ် ပရောဂျက်သည် ဝဘ်ဆာဗာ၏ အချက်အလက်၊ ထိန်းသိမ်းမှုနှင့် သတင်းအချက်အလက် စီမံခန့်ခွဲမှုတို့နှင့် ပတ်သက်သည်။ ၎င်းသည် အဖွဲ့အစည်းတစ်ခု၏ ရုပ်ပိုင်းဆိုင်ရာတည်နေရာကို ခြေရာခံခြင်းနှင့် URL အာဏာပိုင်များနှင့် အမည်များကို ခွဲခြားသတ်မှတ်ခြင်းအပါအဝင် သဘောတရားများစွာကို အကျုံးဝင်ပါသည်။",
    img: java7,
  },
  {
    id: 18,
    category: "java",
    title: "8. Airline Reservation System",
    body: "ပရောဂျက်သည် စနစ်အသစ်များနှင့် လုပ်ဆောင်နိုင်စွမ်းအသစ်များ ပေါင်းထည့်ခြင်းဖြင့် လေကြောင်းလိုင်းလုပ်ငန်း၏ တက်ကြွသောလိုအပ်ချက်များနှင့် အမှီလိုက်နိုင်သော open Architecture ပါ၀င်သည့် ဝဘ်အခြေခံတစ်ခုဖြစ်သည်။ ပရောဂျက်တွင် အွန်လိုင်းငွေပေးငွေယူများ၊ ယာဉ်စီးခ၊ ပစ္စည်းစာရင်းနှင့် အီး-လက်မှတ်လုပ်ငန်းများ ပါဝင်သည်။ဆော့ဖ်ဝဲတွင် အဓိက module လေးခုပါ၀င်သည်၊ ဆိုလိုသည်မှာ၊ အသုံးပြုသူမှတ်ပုံတင်ခြင်း၊ အကောင့်ဝင်ခြင်း၊ ကြိုတင်စာရင်းသွင်းခြင်းနှင့် ပယ်ဖျက်ခြင်း တို့ပါဝင်သည်။ အပလီကေးရှင်းသည် TCP/IP ကွန်ရက်ပရိုတိုကောမှတဆင့် ဆက်သွယ်ရေးကို ခွင့်ပြုပေးကာ ကမ္ဘာတစ်ဝှမ်းတွင် အင်တာနက်နှင့် အင်ထရာနက်ဆက်သွယ်ရေးကို အသုံးပြုရာတွင် အဆင်ပြေချောမွေ့စေပါသည်။",
    img: java8,
  },
  {
    id: 19,
    category: "java",
    title: "9. Online Book Store",
    body: "ဤပရောဂျက်သည် စာအုပ်ဝယ်ယူခြင်းလုပ်ငန်းစဉ်ကို ဒစ်ဂျစ်တယ်စနစ်ဖြင့် ဒစ်ဂျစ်တယ်စနစ်ဖြင့် စာအုပ်ဆိုင်များနှင့် စျေးဆိုင်များအတွက် အဓိကအားဖြင့် တီထွင်ခြင်းဖြစ်သည်။ ရည်ရွယ်ချက်မှာ ထိရောက်ပြီး ယုံကြည်စိတ်ချရသော အွန်လိုင်းစာအုပ်များရောင်းချသည့် ပလပ်ဖောင်းကို ဖန်တီးရန်ဖြစ်သည်။ ၎င်းသည် ဒေတာဘေ့စ်တွင် ရောင်းချပြီး စတော့စာအုပ်များကိုလည်း အလိုအလျောက် မှတ်တမ်းတင်ပါသည်။",
    img: java9,
  },
  {
    id: 20,
    category: "java",
    title: "10. Snake Game in Java",
    body: "အကယ်၍ သင်သည် 90s ကလေး သို့မဟုတ် အရွယ်ရောက်ပြီးသူဖြစ်ပါက သင့်ဖုန်းတွင် ဤဂိမ်းကို ကစားဖူးပေမည်။ ဤဂိမ်း၏ရည်ရွယ်ချက်မှာ မြွေကို မျက်နှာပြင်ပေါ်ရှိ နယ်နိမိတ်ထိမထိဘဲ မြွေတိုကင်များကို စားစေရန်ဖြစ်သည်။ မြွေက တိုကင်ကိုစားတိုင်း ရမှတ်ကို အပ်ဒိတ်လုပ်သည်။ မြွေသည် နယ်နိမိတ်ကို ထိသောအခါ ကစားသမားသည် ရှုံးပြီး နောက်ဆုံးရမှတ်ကို ပြသသည်။",
    img: java10,
  },
  {
    id: 21,
    category: "pp",
    title: "1. တရားဝင်ဖြစ်နိုင်မှုကို ပံ့ပိုးပေးသည့် နောက်ခံကို အသုံးပြုပါ။",
    body: "လက်လှမ်းမီနိုင်သော တင်ပြချက်များကို ပြင်ဆင်သောအခါတွင် စာသားရှင်းလင်းနိုင်မှုသည် အရေးကြီးပါသည်။ စာသားကို လွှမ်းမိုးနိုင်သော နောက်ခံကို အသုံးပြုခြင်းသည် PowerPoint ဖြင့် သင့်ကိုယ်သင် Death ရရှိရန် အမြန်နည်းလမ်းတစ်ခုဖြစ်သည်။ အဲဒါကို ရှောင်ဖို့ ပထမဆုံးလုပ်ရမယ့် အရာက ရှုပ်ပွနေတဲ့ နောက်ခံကို ရှောင်ဖို့ပါပဲ။PowerPoint တင်ဆက်မှုအား ဆွဲဆောင်မှုဖြစ်စေရန် ထည့်သွင်းစဉ်းစားသောအခါတွင် သင်၏နောက်ခံအရောင်ကို ရိုးရှင်းစွာထားရှိခြင်းသည် ၎င်းကိုလုပ်ဆောင်ရန်နည်းလမ်းတစ်ခုဖြစ်သည်။",
    img: pp1,
  },
  {
    id: 22,
    category: "pp",
    title: "2. စာကြောင်းများ အလွန်အကျွံ မသုံးပါနှင့်",
    body: "စာသားမျဉ်းအနည်းငယ်ကိုအသုံးပြုခြင်းသည် သင့်အကြောင်းအရာကို ထင်ရှားပေါ်လွင်စေပြီး ၎င်းတို့ကို မည်သည့်နေရာတွင်ထားရှိသည်ဖြစ်စေ ပရိသတ်အတွက် လူဖတ်ရလွယ်ကူစေသည်။ကြီးမားသောဖောင့်အရွယ်အစားနှင့် စာသားမျဉ်းအနည်းငယ်သည် ဆလိုက်များဖြင့်ဖတ်ခြင်းအစား အကြောင်းအရာကို အာရုံစိုက်နိုင်စေပါသည်။ စာသား ၃-၆ ကြောင်းကြားရှိ မည်သည့်အရာမဆို ဆလိုက်တစ်ခုအတွက် လုံလောက်သည်ထက် ပိုနေသင့်သည်။ သင်၏ဆလိုက်များကိုအာရုံစိုက်ပြီး သင့်ပရိသတ်ကိုလည်း အလားတူလုပ်ဆောင်နိုင်စေမည့် PowerPoint တင်ဆက်မှုပုံစံ၏ နမူနာကောင်းတစ်ခုဖြစ်လာပေမည်။ တင်ပြချက်များအတွက် နိယာမသုံးရပ်သည် ဤကိစ္စရပ်တွင်လည်း အကျုံးဝင်ပါသည်။မင်းရဲ့ဆလိုက်တွေကို ဘယ်လိုတည်ဆောက်ရမလဲဆိုတာ ပိုနားလည်ချင်တယ်ဆိုရင်တော့ မင်းတင်ဆက်မှုပုံစံတည်ဆောက်ပုံနဲ့ ပတ်သက်တဲ့ အကြံပြုချက်တွေရဲ့ ပို့စ်ကို ကြည့်ပါ။",
    img: pp2,
  },
  {
    id: 23,
    category: "pp",
    title: "3. အဓိကအချက်များအား ဂရုတစိုက်ကိုယ်စားပြုပါ။",
    body: "တင်ဆက်မှုတစ်ခုပြုလုပ်သောအခါတွင် လူအများသည် အွန်လိုင်းတွင် အကြံဥာဏ်များရယူရန် နမူနာတင်ဆက်မှုများကို ရှာဖွေကြသည်။ ကျောင်းသားများအတွက် PowerPoint တင်ဆက်မှုနမူနာများကို သင်ရှာနေပါသလား၊ pitch deck ဖန်တီးရန် စွန့်ဦးတီထွင်သူပဲဖြစ်ဖြစ်၊ ပရောဂျက်တစ်ခုကို အမှတ်ရရန် ရှာဖွေနေသည့် အလွတ်တန်းစားတစ်ယောက်ပဲဖြစ်ဖြစ်၊ နမူနာကောင်းတစ်ခုသည် အဓိကကျသောအချက်များကို တိကျစွာ ပေးဆောင်ပေးမည့် အမြဲတမ်းတစ်ခုဖြစ်သည်။ ရိုးရှင်းသော အပြင်အဆင်ကို အသုံးပြု၍ မရှိမဖြစ်လိုအပ်သော အချက်များကို အာရုံစိုက်ပြီး သင်ကိုယ်တိုင် လုပ်ဆောင်နိုင်ပါသည်။ အဓိကအချက်များအား ကိုယ်စားပြုသည့်အခါ၊ သင်သည် ရိုးရာကျည်ဆန်များစာရင်းများ သို့မဟုတ် အခြားဂရပ်ဖစ်များကို အသုံးပြုနိုင်ပြီး၊ အချက်တစ်ခုစီကို အကွက်ကဲ့သို့သော ဒီဇိုင်းဒြပ်စင်ကို အသုံးပြု၍ မီးမောင်းထိုးပြသည့် သို့မဟုတ် အင်ဖိုဂရပ်ဖစ်ကို အသုံးပြုကာ အတွဲလိုက်ကို ပြသနိုင်သည်။",
    img: pp3,
  },
  {
    id: 24,
    category: "pp",
    title: "4. ရိုးရာဖောင့်များကို မှီဝဲပါ။",
    body: "ဖန်စီဖောင့်အသစ်များသည် အသုံးပြုရန် ဆွဲဆောင်မှုရှိသည်ဟု ထင်ရသော်လည်း Cambria၊ Helvetica သို့မဟုတ် Calibri ကဲ့သို့သော ရိုးရာဖောင့်များကို စွဲကိုင်ခြင်းသည် များစွာသာလွန်သော ရွေးချယ်မှုတစ်ခုဖြစ်သည်။ Sans Sheriff သည် ဆလိုက်များကို ဒီဇိုင်းဆွဲရာတွင် ကောင်းမွန်သော ရွေးချယ်မှုတစ်ခုဖြစ်ပြီး ဤအမျိုးအစားပုံစံမိသားစုမှ ဖောင့်များကို မျက်နှာပြင်ကြီးတွင်ပြသသည့်အခါတွင် ဖတ်ရှုရလွယ်ကူပြီး ထင်ရှားသောကြောင့်ဖြစ်သည်။",
    img: pp4,
  },
  {
    id: 25,
    category: "pp",
    title: "5. Font အရွယ်အစားကို ဂရုပြုပါ။",
    body: "သင်၏ဆလိုက်များကို ဒီဇိုင်းဆွဲရာတွင် နောက်ထပ်အရေးကြီးသည့်အချက်မှာ သင်၏ဖောင့်အရွယ်အစားကို ကြီးစေရန်ဖြစ်သည်။ Guy Kawasaki က အချက် 30 စာလုံးဖောင့် (တင်ဆက်မှုများအတွက် 10/20/30 စည်းမျဉ်းကိုကြည့်ပါ)၊ Steve Jobs က အချက် 190 စာသားကို အသုံးပြုထားစဉ်၊သို့သော် ပရိသတ်၏နောက်တွင်ထိုင်နေသော တစ်စုံတစ်ယောက်သည် သင့်စာသားကို လွယ်ကူစွာဖတ်နိုင်သရွေ့ ၎င်းထက်နည်းသည့်အရာတစ်ခုကို သင်စွဲကိုင်ထားနိုင်သည်။ အိုင်ဒီယာသည် ကြီးမားသောဖောင့်ကိုသုံးရန်၊ စာသားနည်းပြီး အဓိကအချက်များကို ယုံကြည်စိတ်ချစွာ သင်ကိုယ်တိုင်ရှင်းပြရန်ဖြစ်သည်။",
    img: pp5,
  },
  {
    id: 26,
    category: "pp",
    title: "6. အရောင်များစွာကို မသုံးပါနှင့်",
    body: "သင်၏တင်ဆက်မှုဆလိုက်များကို ဒီဇိုင်းဆွဲသည့်အခါ ၎င်းတို့ကို သက်တံအဖြစ်သို့ ပြောင်းလဲခြင်းမှ ရှောင်ကြဉ်ပါ။ သင့်အကြောင်းအရာတွင် အရောင်များစွာ မလိုအပ်ပါ။ သင်၏အခြေခံဒီဇိုင်းတွင် အရောင် 2-3 ရောင်နှင့် အများဆုံး 6 ရောင်သည် သင့်ပရိသတ်အတွက် အမြင်အာရုံဆွဲဆောင်မှုရှိပြီး လိုက်ရန်လွယ်ကူသော ပြီးပြည့်စုံသောမြင်သာထင်သာရှိသော slide deck ကို ဒီဇိုင်းထုတ်ရာတွင် ကူညီပေးရန်အတွက် လုံလောက်သင့်ပါသည်။",
    img: pp6,
  },
  {
    id: 27,
    category: "pp",
    title: "7. Slide တစ်ခုလျှင် ပုံတစ်ပုံကို သုံးကြည့်ပါ။",
    body: "ပုံပေါင်းမြောက်များစွာကို ဖန်တီးရန်နှင့် ပုံအများအပြားကို အသုံးပြုရန် ဆွဲဆောင်နိုင်သော်လည်း၊ ဆလိုက်တစ်ခုလျှင် ကြီးမားသောပုံတစ်ပုံသာ အသုံးပြုခြင်းသည် အကျိုးသက်ရောက်မှုရှိနိုင်သည်။ ၎င်းသည် ပုံများစွာကြောင့် သင့်ပရိသတ်ကို စိတ်အနှောင့်အယှက်မဖြစ်စေရန်လည်း ကူညီပေးနိုင်ပါသည်။ ဥပမာအားဖြင့် သင်သည် ဆန့်ကျင်ဘက်ဦးတည်ချက်ဖြင့် စာသားကို ဆလိုက်၏ ညာဘက် သို့မဟုတ် ဘယ်ဘက်တွင် ထားနိုင်သည်။",
    img: pp7,
  },
  {
    id: 28,
    category: "pp",
    title: "8. Visual ကို Emotional Appeal ဖြင့် အသုံးပြုပါ။",
    body: "Slide တစ်ခုတွင် ပုံတစ်ပုံကို အသုံးပြုခြင်းသည် ကောင်းသောအကြံဖြစ်နိုင်သော်လည်း မှန်ကန်သောပုံကို အသုံးပြုခြင်းသည်လည်း အရေးကြီးပါသည်။ စိတ်ခံစားမှုကို လှုံ့ဆော်ပေးသော ရုပ်ပုံများကို အသုံးပြုခြင်းဖြင့် သင့်ပရိသတ်၏ ယုံကြည်မှုနှင့် ချီးကျူးမှုကို ရရှိရန် ကူညီပေးနိုင်ပါသည်။ ၎င်းသည် ပရိသတ်တစ်ဦးအတွက် အခြားနည်းဖြင့် ရိုးရှင်းသောအကြောင်းအရာကို ပိုမိုစွဲဆောင်နိုင်စေရန်လည်း ကူညီပေးနိုင်ပါသည်။",
    img: pp8,
  },
  {
    id: 29,
    category: "pp",
    title: "9. သင်၏ဆလိုက်များကို ရိုးရိုးရှင်းရှင်းထားပါ။",
    body: "မင်းရဲ့ slides တွေမှာ အချက်အလက်တွေ အရမ်းများနေတယ်ဆိုရင် မလုပ်ပါနဲ့။ အနမ်းနိယာမကို အခွင့်ကောင်းယူပါ။ အကြောင်းအရာများလွန်းသော ရှုပ်ပွနေသောဆလိုက်သည် သင့်ပရိသတ်အတွက် အမြင်အာရုံကို အနှောင့်အယှက်ဖြစ်စေနိုင်သည်။ သင့်ရုပ်ပုံများအတိုင်း ရိုးရိုးရှင်းရှင်းနှင့် အခြေခံတစ်ခုခုကို အသုံးပြုခြင်းသည် သင်တင်ပြသည့်အကြောင်းအရာအပေါ် တည်ဆောက်ရန် လုံလောက်သင့်သည်။",
    img: pp9,
  },
  {
    id: 30,
    category: "pp",
    title: "10. ပုံသေဒီဇိုင်းရွေးချယ်မှုများကို အသုံးပြုပါ။",
    body: "PowerPoint သို့မဟုတ် အခြားသောတင်ဆက်မှုအက်ပ်များအတွင်း ပံ့ပိုးပေးထားသည့် စတော့ဓာတ်ပုံများကို အသုံးပြုရာတွင် အန္တရာယ်မရှိသည့်အပြင် သင်တင်ဆက်မှုစလိုက်များကို ဖန်တီးရာတွင် Artificial Intelligence algorithms များအပေါ်အခြေခံ၍ ဒီဇိုင်းအကြံပြုချက်များကို ရယူရန်အတွက် PowerPoint Designer ကဲ့သို့သော အင်္ဂါရပ်များကဲ့သို့ စွမ်းဆောင်နိုင်ရည်မရှိပါ။ ၎င်းသည် သင့်အား အချိန်ကုန်သက်သာစေပြီး သင်၏တင်ဆက်မှုဆလိုက်များကို အစမှအဆုံးဒီဇိုင်းဆွဲရန် နာရီများစွာမဖြုန်းဘဲ အမြင်အာရုံဆွဲဆောင်နိုင်သော ဆလိုက်များကို ဖန်တီးနိုင်မည်ဖြစ်သည်။",
    img: pp10,
  },
  {
    id: 31,
    category: "pp",
    title: "နောက်ဆုံးစကား",
    body: "သင်၏ဆလိုက်များကို ဒီဇိုင်းဆွဲခြင်းသည် ရှုပ်ပွမှုမရှိသော၊ အမြင်အာရုံအားကြီးသော အကြောင်းအရာကို အသုံးပြုခြင်းနှင့် အဓိကအားဖြင့် ဆက်စပ်နေသော ဂရုတစိုက်ထည့်သွင်းစဉ်းစားမှုအနည်းငယ် လိုအပ်ပါသည်။ သင့်တင်ပြချက်များကို ထိထိရောက်ရောက်ဖြစ်စေရန်အတွက် ပုံပြင်ပြောခြင်းကိုလည်း ထည့်သွင်းနိုင်ပြီး KISS စည်းမျဉ်းကို အသုံးပြုနိုင်သည်။",
    img: pp11,
  },
  {
    id: 41,
    category: "hw",
    title: "1. Make a Buzz Wire Game With an Arduino",
    body: "You will need:\n1 x Small Arduino compatible buzzer\n1 x Old metal coat hanger\nThis build combines a classic carnival game with simple electronics and code. Using cheap components and a little DIY craft, the Arduino Buzz Wire Game is a fantastic project to work on with children.",
    img: hw1,
  },
  {
    id: 42,
    category: "hw",
    title: "2. Arduino MIDI Controller",
    body: "You will need: \n1 x 5-pin DIN female socket\n1 x MIDI cable\n1 x MIDI interface or MIDI capable device\nAny musician who is familiar with MIDI controllers knows how powerful they can be. Did you know that you can use an Arduino to make a DIY MIDI controller? Even if you've never used one, this is a perfect way to get started, rather than buying an expensive keyboard or controller.The project uses a free MIDI code library and simple components. It's beginner-friendly, and has the potential to be improved over time, until you have a fully featured custom MIDI controller!",
    img: hw2,
  },
  {
    id: 43,
    category: "hw",
    title: "3. Arduino Game Controller",
    body: "You will need:\nPush-buttons\nThe only thing cooler than making your own games is making your own game controller.\nThis Instructables project shows you just how easy it is to build your own controller step-by-step so that you can control your favorite game on your computer. It's also customizable, so you can configure the controller for the specifics of each game.",
    img: hw3,
  },
  {
    id: 44,
    category: "hw",
    title: "4. Arduino RFID Smart Lock",
    body: "You will need:\n1 x Logic-level N channel MOSFET\n1 x MFRC522 module\n1 x 12V Solenoid\n1 x 12V Power supply\nThis Arduino smart locking system looks complicated. But due to a cheap and easy-to-use RFID reader, it's more straightforward than you'd think.This project uses a few parts that may be new to you. Rather than starting from scratch, the code is modified from existing examples. This is an excellent introduction to multi-component devices with real practical uses.",
    img: hw4,
  },
  {
    id: 45,
    category: "hw",
    title: "5. Simple Arduino Alarm System",
    body: "You will need:\n1 x Ultrasonic 'ping' sensor\n1 x Piezo buzzer\n1 x LED strip light\nA simple alarm system that uses a motion sensor to detect movement. LEDs flash and a high-pitched warning tone is emitted when an intruder is detected.\nWhile it's not exactly proper home protection, it does offer a perfect solution to protect small spaces. Ideal for keeping an eye on your snack drawer!",
    img: hw5,
  },
  {
    id: 46,
    category: "hw",
    title: "7. Traffic Light Controller",
    body: "This project is a great introduction to Arduino programming. The traffic light controller uses a red, yellow, and green LED to re-create a traffic light on your breadboard. It's an easy way to get hands-on with writing and editing code. As a bonus, all the required components should be included in your starter kit. And for a project you can create without programming, take a look at how to use Xod to build an Arduino robot.",
    img: hw6,
  },
];
